app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "created_datetime", "description", "minimum_bid", "modified_datetime", "state", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])
    @item.created_datetime=Time.now

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @item = Item.find(params[:id])